Revit 2025 API
SpatialElementType Enumeration
 An enumerated type listing types of spaces.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum SpatialElementType
Public Enumeration SpatialElementType
public enum class SpatialElementType
type SpatialElementType
Members
Member name | Value | Description
Room | 1 |  Room
Area | 2 |  Area
Space | 3 |  Space
ElectricalLoadArea | 4 |  Electrical Load Area
See Also
Reference
Autodesk.Revit.DB Namespace